{
	"current": [
		{
			"version": "0.23",
			"date": "April 8 2025",
			"content": [
				"Fixed major loading bug, fixed lots of mod errors, & cleaned up a bunch of code",
       			"Added Custom Fog Mod (will work once BWD fixes the in-game fog system)",
				"Official BWD Content Creators now get profile badges linked to their social media account!",
				"Added the \"Shadowborn Survivor\" (EGG ORG 2025) event badge, which will be unlocked with its icon revealed once the event ends.",
				"Added the \"Shell League Staff\" and \"Shell Wiki Staff\" badges for Shell League and Shell Wiki staff members",
				"Changed icons for tiers 1-3 of the \"Pro Egg Gamer\" badge",
				"Optimized Better Inventory code for faster item loading/tab switching times",
				"Introducing the Item Vault! You can now preview unowned vaulted items only in the inventory."
			]
		}
	],
	"old": [
		{
			"version": "0.22",
			"date": "March 18 2025",
			"content": [
				"Fixed bug with profile badge alert popup getting stuck on startup",
				"Icons on Social items now link to their respective BWD Social Media pages",
				"Fixed bugs with Game History after loading screen & game code format update",
				"Major changes (fixes) made to King Hayden theme",
				"Minor changes made to Infinite, Graysocean, Boolet themes"
			]
		},
		{
			"version": "0.21",
			"date": "February 19 2025",
			"content": [
				"Fixed bug with Chick'n Winner Owned Item Images showing for all 3 eggs",
				"Fixed bug with Game History glitching after seasonal maps get removed",
				"Removed # in front of game codes on the Game History popup",
				"The Chick'n Winner Popup can now only be closed after you get your reward  - no more accidental closures!",
				"The Corrupted Grenade has been promoted to Premium item status!",
				"Fixed Errors with Custom Skybox Mod (caused by Update 0.50.9)"
			]
		},
		{
			"version": "0.20",
			"date": "January 5 2025",
			"content": [
				"Game History now periodically checks whether games are still open",
				"Switching Better Inventory on/off now looks much smoother",
				"Map Images on the Game History and Public Maps popups now match the Create Private Game popup",
				"Chick'n Winner now shows when you pull an item you already own!",
				"Fixed Chick'n Winner egg icon not being on the same line as egg reward amount"
			]
		},
		{
			"version": "0.19",
			"date": "January 2 2025",
			"content": [
				"The MegaMod can now check for updates even when a fatal error occurs.",
        		"New button & popup added to the homescreen to show your daily lobby history!",
				"Minor tweaks made to the Bundle item theme criteria",
				"Hide HUD now hides the announcement messages in chat",
        		"SFX added to the challenge claim notification popup",
				"Date related profile badges now work more accurately with different date formats",
				"Fixed bug with profile badge CSS not loading",
      			"Better UI now adds your region's numerical separators to your egg count, stats, shop item prices, and MOAR!",
				"The currency icon on Premium items (in inventory) <em>should</em> now match your local currency"
			]
		},
		{
			"version": "0.18",
			"date": "November 16 2024",
			"content": [
				"Fixed loading issue caused by Update 0.50.4",
				"Fixed \"Yolky Merch\" Badge not showing up",
				"Restyled \"Overeggchiever\" V Badge",
				"Restyled \"Eggspenditure\" V Badge",
				"Restyled \"Shell Scrambler\" IV and V Badges",
				"Restyled \"Master of Arms\" V Badge",
				"Restyled \"Splattered Yolk\" V Badge",
				"Restyled \"Rooster Royalty\" V Badge",
				"Restyled \"Coop King\" V Badge",
				"Restyled \"Poached Promoter\" V Badge",
				"Tier badges now have alerts for when they level down, are gained, or are lost!",
				"Core badges now have an alert for when you gain or lose them!"
			]
		},
		{
			"version": "0.17",
			"date": "November 8 2024",
			"content": [
				"Shell now automatically reloads after you update The MegaMod!",
				"Fixed tier badge level up alert showing when badges level down",
				"Fixed stamps not being sorted correctly in the inventory",
				"Buffed tier requirements for \"Eggstra Spender\" Badge",
				"Buffed tier requirements for \"Eggspenditure\" Badge"
			]
		},
		{
			"version": "0.16",
			"date": "November 2 2024",
			"content": [
				"Fixed grenade pickups not updating in first-person spectate mode",
				"Fixed \"killstreak\" typo - thanks Godric!",
				"Fixed egg premium items not being grouped with premiums",
				"Optimized some setting saving logic",
				"Tweaked color of \"Very Good Wizard\" Badge to match BWD Blue",
				"Refined requirement for \"Treasure Hunter\" Badge to include account age",
				"Buffed tier requirements for \"Royal Rooster\" Badge",
				"Buffed tier requirements for \"Coop King\" Badge",
				"Tier badges now show a notification when they level up!",
				"Added the Gus theme and matching Gus skybox!"
			]
		},
		{
			"version": "0.15",
			"date": "October 18 2024",
			"content": [
				"Fixed some buggy code - skyboxes <em>should</em> load properly now",
        		"Work-in-Progress (WIP) themes: King Hayden, Novosuper, and menoXD"
			]
		},
		{
			"version": "0.14",
			"date": "October 17 2024",
			"content": [
				"Rewrote some Better Inventory code",
				"Color slider colors <em>should</em> be auto-applied more reliably now",
				"Added some Work-in-Progress (WIP) themes: King Hayden, Novosuper, and menoXD"
			]
		},
		{
			"version": "0.13",
			"date": "October 17 2024",
			"content": [
				"The first update for playtesters!",
				"Fixed bug with Better UI enabling even when disabled",
				"Added new tier badges: Splattered Yolk (lifetime deaths) and Humpty's Fall (fall deaths)",
				"Ishmyster, Grinder, and Simsim - enjoy your Playtester Badges!"
			]
		},
		{
			"version": "0.12",
			"date": "October 16 2024",
			"content": [
				"The MegaMod is open for playtesting - enjoy!",
				"Fixed some typos in the UI",
				"Fixed bug with skybox settings not saving properly",
				"Themes load slightly faster"
			]
		},
		{
			"version": "0.11",
			"date": "October 14 2024",
			"content": [
				"Testing script auto-update feature - fingers crossed!",
				"MegaMod startup <em>should</em> be more reliable now...hopefully"
			]
		},	
		{
			"version": "0.10",
			"date": "October 13 2024",
			"content": [
				"Fixed all the bugs caused by the Game Engine Update (0.50.0)",
				"Added support for proxies (Alternate URLs) to MegaMod userscript",
				"Fixed some minor UI bugs with inventory items and profile badges"
			]
		},
		{
			"version": "1.00",
			"date": "??? (When The MegaMod Releases)",
			"content": [
				"<b>After waaaaaaay too long, <i>The MegaMod</i> is finally released!!!</b>",
				"Special thanks to <b>Ali Gamer, Boolet, DeathlyLove, Fallen, Godric, Grinder, Grif, Gus, King Hayden, Ishmyster, SimSim, Snapper, and Wes</b> for their help with playtesting!",
				"Mods and their settings are on the <b class='changelog-link' onclick='vueApp.showMegaModTab(true)'>brand new tabs</b> in the settings menu.",
				"<b>Improved UI & Fixed Bugs</b> in the inventory, profile screen, and elsewhere!",
				"<b>Profile Badges</b> added to the profile screen!",
				"<b>Legacy default gun skins</b> and <b>sound effects</b> from 2018/2019 have returned!",
				"<b>VIP color customization</b> with hue, saturation, and brightness sliders.",
				"<b>Hide the HUD (in-game UI)</b> for cleaner recordings and cinematic shots.",
				"Added a <b>stopwatch</b> while spawned. Detailled killstreak stats popup coming soon!",
				"<b>Grenade pickups</b> match your equipped grenade skin - also works in first-person spectate mode!",
				"Use the <b>FPS slider</b> to set a custom FPS cap and finally play like a pro.",
				"Various features added to <b>spectate mode</b>:<ul><li>See a player's <b>health bar</b> in first-person spectate mode.</li><li>Effortlessly fly around maps with a slider to adjust <b>spectate speed</b>.</li><li><b>Freeze the game</b> in spectate mode for the perfect action shot.</li><li>...and more!</li></ul>",
				"<b>Spin your egg 360°</b> in the Photobooth and export it as a GIF (coming soon).",
				"Explore a handful of <b>custom themes</b> to customize the Shell Shockers UI.",
				"Choose from <b>over 60 new skybox options</b> or <b>any solid color</b> for a unique in-game atmosphere!",
				"Customize the <b>in-game fog</b> with adjustable <b>density</b> and <b>color</b> to create anything from a light mist to complete blindness!"
			]
		}
	]
}